# AddBuildingStorey Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExporterIFC..::..AddBuildingStorey Method
ExporterIFC Class See Also
---
Adds building storey to the exporter's internal cache.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public void AddBuildingStorey(
	ElementId id,
	IFCLevelInfo levelInfo
)
```

Visual Basic
---
```text
Public Sub AddBuildingStorey ( _
	id As ElementId, _
	levelInfo As IFCLevelInfo _
)
```

Visual C++
---
```text
public:
void AddBuildingStorey(
	ElementId^ id,
	IFCLevelInfo^ levelInfo
)
```

# ### Parameters
id
    Type: Autodesk.Revit.DB..::..ElementId The level id.
levelInfo
    Type: Autodesk.Revit.DB.IFC..::..IFCLevelInfo The IFCLevelInfo object.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ExporterIFC Class
Autodesk.Revit.DB.IFC Namespace